---
kind: method
id: M:Autodesk.Revit.DB.APIObject.Dispose
source: html/7c03212a-b587-1c89-3912-efea0d2619c5.htm
---
# Autodesk.Revit.DB.APIObject.Dispose Method

Causes the object to release immediately any resources it may be utilizing.

## Syntax (C#)
```csharp
public void Dispose()
```

## Remarks
This method is usually called implicitly by the programming language when
the object is destroyed. After calling this method the object will no longer work correctly.